app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Rupert's onboarding"], ["created_at", "2018-01-22 18:23:48.959054"], ["updated_at", "2018-01-22 18:23:48.959054"]]
---
  def create
    @list = List.new(list_params)

    if @list.save