app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    if @task.valid?
      @task.save
---
INSERT INTO "tasks" ("description", "completed", "created_at", "updated_at", "list_id") VALUES (?, ?, ?, ?, ?)  [["description", "First task"], ["completed", "f"], ["created_at", "2018-01-22 18:24:07.865375"], ["updated_at", "2018-01-22 18:24:07.865375"], ["list_id", 2]]

  def update
    @task = Task.find(params[:id])
    @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", "t"], ["updated_at", "2018-01-22 18:24:18.362701"], ["id", 1]]