app/controllers/tasks_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    @task = Task.new(task_params)
    @task.completed = false
    @task.list = List.find(params[:list_id])